xiongyumail/esp32-s2beta-hmi/project/camera/components/esp32-camera/driver/camera_32s2.c
// Copyright 2015-2016 Espressif Systems (Shanghai) PTE LTD
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include "time.h"
#include "sys/time.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "freertos/semphr.h"
#include "esp32s2beta/rom/lldesc.h"
#include "soc/soc.h"
#include "soc/gpio_sig_map.h"
#include "soc/i2s_reg.h"
#include "soc/i2s_struct.h"
#include "soc/io_mux_reg.h"
#include "driver/gpio.h"
#include "driver/rtc_io.h"
#include "driver/periph_ctrl.h"
#include "esp_intr_alloc.h"
#include "sensor.h"
#include "sccb.h"
#include "esp_camera.h"
#include "camera_common.h"
#include "xclk.h"
#if CONFIG_OV2640_SUPPORT
#include "ov2640.h"
#endif
#if CONFIG_OV7725_SUPPORT
#include "ov7725.h"
#endif
#if CONFIG_OV3660_SUPPORT
#include "ov3660.h"
#endif


typedef enum {
    CAMERA_NONE = 0,
    CAMERA_UNKNOWN = 1,
    CAMERA_OV7725 = 7725,
    CAMERA_OV2640 = 2640,
    CAMERA_OV3660 = 3660,
} camera_model_t;

typedef struct camera_fb_s {
    uint8_t * buf;
    size_t len;
    size_t width;
    size_t height;
    pixformat_t format;
    size_t size;
    uint8_t ref;
    uint8_t bad;
    struct camera_fb_s * next;
} camera_fb_int_t;

typedef void (*dma_filter_t)(int dma_buf_id, int frame_id, camera_fb_int_t *fb);

typedef struct {
    camera_config_t config;
    sensor_t sensor;

    camera_fb_int_t *fb;
    size_t fb_size;
    size_t data_size;

    size_t width;
    size_t height;
    size_t in_bytes_per_pixel;
    size_t fb_bytes_per_pixel;

    size_t dma_received_count;
    size_t dma_filtered_count;
    size_t dma_per_line;
    size_t dma_buf_width;
    size_t dma_sample_count;
    int    dma_desc_inc_cnt;
    size_t dma_desc_cur;
    int dma_suc_eof_max;
    lldesc_t *dma_desc;
    dma_elem_t **dma_buf;

    dma_filter_t dma_filter;
    intr_handle_t i2s_intr_handle;
    QueueHandle_t data_ready;
    QueueHandle_t fb_in;
    QueueHandle_t fb_out;
    TaskHandle_t dma_filter_task_fd;
} camera_state_t;


camera_state_t* s_state = NULL;

typedef union {
    struct {
        uint32_t dma_buf_id: 8;
        uint32_t fram_id:   16;
        uint32_t fram_sta:   8;
    };
    uint32_t va;
} dma_fram_item_t;

typedef enum {
    FRAME_BEGIN,
    FRAME_OK,
    FRAM_DONE,
    FRAME_ERR,
} frame_stat_t;

#define REG_PID        0x0A
#define REG_VER        0x0B
#define REG_MIDH       0x1C
#define REG_MIDL       0x1D

#define REG16_CHIDH     0x300A
#define REG16_CHIDL     0x300B

#if defined(ARDUINO_ARCH_ESP32) && defined(CONFIG_ARDUHAL_ESP_LOG)
#include "esp32-hal-log.h"
#define TAG ""
#else
#include "esp_log.h"
static const char* TAG = "camera";
#endif

#define DMA_BUF_MAX_SIZE   (4095)
#define DMA_DESC_CNT       (10)

//Invalid dma fram id
#define INVAL_FRAM_ID (0xffff)

static bool is_hs_mode(void)
{
    return s_state->config.xclk_freq_hz > 10000000;
}

static inline void IRAM_ATTR i2s_conf_reset()
{
    I2S0.lc_conf.in_rst  = 1;
    I2S0.lc_conf.in_rst  = 0;
    I2S0.lc_conf.ahbm_fifo_rst = 1;
    I2S0.lc_conf.ahbm_fifo_rst = 0;
    I2S0.lc_conf.ahbm_rst = 1;
    I2S0.lc_conf.ahbm_rst = 0;

    I2S0.conf.rx_reset = 1;
    I2S0.conf.rx_reset = 0;
    I2S0.conf.rx_fifo_reset = 1;
    I2S0.conf.rx_fifo_reset = 0;
    I2S0.conf2.cam_sync_fifo_reset = 1;
    I2S0.conf2.cam_sync_fifo_reset = 0;    
    while ( GET_PERI_REG_MASK(I2S_CONF_REG(0), I2S_RX_FIFO_RESET_ST_M) );
}

static int  fram_id = 0;

static void IRAM_ATTR signal_dma_buf_received(void)
{
    dma_fram_item_t fram_item;
    fram_item.dma_buf_id = s_state->dma_desc_cur;
    fram_item.fram_id = fram_id;
    portBASE_TYPE high_priority_task_awoken = 0;
    //For JPEG mode
    if (I2S0.rx_eof_num < 10) {
        I2S0.conf.rx_start = 0;
        I2S0.rx_eof_num = s_state->dma_sample_count;
        fram_item.fram_sta =  FRAM_DONE;
        //end of the frame
        fram_id = (s_state->dma_suc_eof_max - s_state->dma_desc_inc_cnt);
    } else {
        fram_item.fram_sta =  FRAME_OK;
    }
    // If the queue is full, the frame will be lost, reset the queue
    if (xQueueSendFromISR(s_state->data_ready, (void *)&fram_item, &high_priority_task_awoken) != pdTRUE) {
        xQueueReset(s_state->data_ready);
        //Queue is full but a new frame begins, reset the queue and receive this frame.
        if (fram_id == 0) {
            fram_item.fram_sta =  FRAME_OK;
            xQueueSendFromISR(s_state->data_ready, (void *)&fram_item, &high_priority_task_awoken);
        }
    }
    fram_id = (fram_id == s_state->dma_suc_eof_max - s_state->dma_desc_inc_cnt) ? 0 : fram_id + s_state->dma_desc_inc_cnt;
    s_state->dma_desc_cur = (s_state->dma_desc_cur == DMA_DESC_CNT - s_state->dma_desc_inc_cnt) ? 0 : s_state->dma_desc_cur + s_state->dma_desc_inc_cnt;
    if (high_priority_task_awoken == pdTRUE) {
        portYIELD_FROM_ISR();
    }
}

static void IRAM_ATTR vsync_intr_disable(void)
{
    gpio_set_intr_type(s_state->config.pin_vsync, GPIO_INTR_DISABLE);
}

static void vsync_intr_enable(void)
{
    gpio_set_intr_type(s_state->config.pin_vsync, GPIO_INTR_NEGEDGE);
}

static void IRAM_ATTR i2s_isr(void *param)
{
    typeof(I2S0.int_st) int_st = I2S0.int_st;
    I2S0.int_clr.val = ~0;
    if (int_st.in_suc_eof) {
        signal_dma_buf_received();
    }
    return;
    //Jpeg_mode
    if (I2S0.conf.rx_start == 0) {
        i2s_conf_reset();
        I2S0.in_link.addr = (uint32_t) &s_state->dma_desc[s_state->dma_desc_cur];
        I2S0.in_link.start = 1;
        I2S0.conf.rx_start = 1;
        vsync_intr_enable();
   }
}

static void IRAM_ATTR vsync_isr(void* arg)
{
    if (I2S0.conf.rx_start && fram_id) {
        I2S0.rx_eof_num = 1;
        I2S0.in_link.start = 0;
        vsync_intr_disable();
    }
}

static void IRAM_ATTR i2s_start_bus()
{
    s_state->dma_desc_cur = 0;
    s_state->dma_received_count = 0;
    I2S0.int_ena.val = 0;
    //s_state->dma_filtered_count = 0;
    I2S0.fifo_conf.dscr_en = 1;
    I2S0.conf2.cam_sync_fifo_reset = 0;
    I2S0.int_clr.val = I2S0.int_raw.val;
    I2S0.rx_eof_num = s_state->dma_sample_count;
    I2S0.int_ena.in_suc_eof = 1;
    I2S0.in_link.addr = (uint32_t) &s_state->dma_desc[0];
    I2S0.in_link.start = 1;
    I2S0.conf.rx_start = 1;
    if (s_state->config.pixel_format == PIXFORMAT_JPEG) {
        vsync_intr_enable();
    }
}

static int i2s_run(void)
{
    for (int i = 0; i < DMA_DESC_CNT; ++i) {
        lldesc_t* d = &s_state->dma_desc[i];
        ESP_LOGV(TAG, "DMA desc %2d: %u %u %u %u %u %u %p %p",
                 i, d->length, d->size, d->offset, d->eof, d->sosf, d->owner, d->buf, d->qe.stqe_next);
        memset(s_state->dma_buf[i], 0, d->length);
    }
    // wait for frame
    camera_fb_int_t * fb = s_state->fb;
    while (s_state->config.fb_count > 1) {
        while (s_state->fb->ref && s_state->fb->next != fb) {
            s_state->fb = s_state->fb->next;
        }
        if (s_state->fb->ref == 0) {
            break;
        }
    }
    esp_intr_enable(s_state->i2s_intr_handle);
    camera_fb_int_t *fb_tmp = s_state->fb;
    for (int i = 0; i < s_state->config.fb_count; i++) {
        xQueueSend(s_state->fb_in, &fb_tmp, portMAX_DELAY);
        fb_tmp = fb_tmp->next;
    }
    i2s_conf_reset();
    i2s_start_bus();
    return 0;
}

