xiongyumail/esp32-s2beta-hmi/project/camera/components/esp32-camera/driver/camera_32s2.c
static void i2s_init(void)
{
    camera_config_t* config = &s_state->config;

    // Configure input GPIOs
    gpio_num_t pins[] = {
        config->pin_d7,
        config->pin_d6,
        config->pin_d5,
        config->pin_d4,
        config->pin_d3,
        config->pin_d2,
        config->pin_d1,
        config->pin_d0,
        config->pin_vsync,
        config->pin_href,
        config->pin_pclk
    };
    gpio_config_t conf = {
        .mode = GPIO_MODE_INPUT,
        .pull_up_en = GPIO_PULLUP_ENABLE,
        .pull_down_en = GPIO_PULLDOWN_DISABLE,
        .intr_type = GPIO_INTR_DISABLE
    };
    for (int i = 0; i < sizeof(pins) / sizeof(gpio_num_t); ++i) {
        if (rtc_gpio_is_valid_gpio(pins[i])) {
            rtc_gpio_deinit(pins[i]);
        }
        conf.pin_bit_mask |= (1LL << pins[i]);
    }

    PIN_FUNC_SELECT(GPIO_PIN_MUX_REG[34], PIN_FUNC_GPIO);
    gpio_set_direction(34, GPIO_MODE_OUTPUT);

    PIN_FUNC_SELECT(GPIO_PIN_MUX_REG[36], PIN_FUNC_GPIO);
    gpio_set_direction(36, GPIO_MODE_OUTPUT);

    gpio_config(&conf);

    // Route input GPIOs to I2S peripheral using GPIO matrix
    // gpio_matrix_in(0x30, I2S0I_H_ENABLE_IDX, false);
    gpio_matrix_in(0x38, I2S0I_H_ENABLE_IDX, false);
    gpio_matrix_in(config->pin_href, I2S0I_H_SYNC_IDX, false);
    gpio_matrix_in(config->pin_vsync, I2S0I_V_SYNC_IDX, true);
    gpio_matrix_in(config->pin_pclk, I2S0I_WS_IN_IDX, false);

    gpio_matrix_in(config->pin_d0, I2S0I_DATA_IN8_IDX, false);
    gpio_matrix_in(config->pin_d1, I2S0I_DATA_IN9_IDX, false);
    gpio_matrix_in(config->pin_d2, I2S0I_DATA_IN10_IDX, false);
    gpio_matrix_in(config->pin_d3, I2S0I_DATA_IN11_IDX, false);
    gpio_matrix_in(config->pin_d4, I2S0I_DATA_IN12_IDX, false);
    gpio_matrix_in(config->pin_d5, I2S0I_DATA_IN13_IDX, false);
    gpio_matrix_in(config->pin_d6, I2S0I_DATA_IN14_IDX, false);
    gpio_matrix_in(config->pin_d7, I2S0I_DATA_IN15_IDX, false);
    uint32_t ws_pin_reg = (GPIO_PIN0_REG+config->pin_pclk*4);
    REG_WRITE(ws_pin_reg, REG_READ(ws_pin_reg) | 0x12);

    // Enable and configure I2S peripheral
    periph_module_enable(PERIPH_I2S0_MODULE);
    // Toggle some reset bits in LC_CONF register
    // Toggle some reset bits in CONF register

    I2S0.clkm_conf.val = 0;
    I2S0.clkm_conf.clkm_div_num = 2;
    I2S0.clkm_conf.clkm_div_b = 0;
    I2S0.clkm_conf.clkm_div_a = 0;
    I2S0.clkm_conf.clk_sel = 2;
    I2S0.clkm_conf.clk_en = 1;
    I2S0.conf.val = 0;
    I2S0.conf1.val = 0;
    I2S0.conf1.rx_pcm_bypass = 1;
    I2S0.sample_rate_conf.val = 0;
    I2S0.sample_rate_conf.rx_bck_div_num = 2;
    I2S0.timing.val = 0;
    I2S0.conf2.val = 0;
    I2S0.fifo_conf.val = 0;
    I2S0.fifo_conf.rx_fifo_mod_force_en = 1;
    I2S0.fifo_conf.rx_data_num = 32;
    // I2S0.conf.rx_right_first = 1;
    I2S0.conf.rx_dma_equal = 1;
    I2S0.conf2.lcd_en = 1;
    I2S0.conf2.camera_en = 1;
    I2S0.conf2.cam_clk_loopback = 0;
    I2S0.conf2.i_v_sync_filter_en = 1;
    I2S0.conf2.i_v_sync_filter_thres = 1;
    I2S0.sample_rate_conf.rx_bits_mod = 8;
    I2S0.conf_chan.rx_chan_mod = 1;
    i2s_conf_reset();
    I2S0.conf2.cam_sync_fifo_reset = 1;
    I2S0.int_ena.val = 0;
    I2S0.int_clr.val = ~0;
    I2S0.timing.rx_ws_in_delay = 3;

    // Allocate I2S interrupt, keep it disabled
    esp_intr_alloc(ETS_I2S0_INTR_SOURCE, ESP_INTR_FLAG_IRAM, i2s_isr, NULL, &s_state->i2s_intr_handle);
}

int fb = 0;

camera_fb_t* esp_camera_fb_get(void)
{
    if (s_state == NULL) {
        return NULL;
    }
    if (!I2S0.conf.rx_start) {
        camera_fb_int_t * fb_tmp = s_state->fb;
        if (i2s_run() != 0) {
            return NULL;
        }
    }
    camera_fb_int_t * fb = NULL;
    if (s_state->fb_out) {
        xQueueReceive(s_state->fb_out, &fb, portMAX_DELAY);
    }
    return (camera_fb_t*)fb;
}

void esp_camera_fb_return(camera_fb_t * fb)
{
    if (fb == NULL || s_state == NULL || s_state->fb_in == NULL) {
        return;
    }
    xQueueSend(s_state->fb_in, &fb, portMAX_DELAY);
}

typedef enum {
    FRAM_BUF_IDLE = 1,
    FRAM_BUF_IN_PROGRESS = 2,
} fram_buf_sta_t;

static void dma_filter_task(void *param)
{
    // Check if it is the expected frame number
    int expect_id = 0;
    dma_fram_item_t fram_item;
    camera_fb_int_t * fb = NULL;
    //frame status
    fram_buf_sta_t fb_sta = FRAM_BUF_IDLE;
    while (1) {
        xQueueReceive(s_state->fb_in, &fb, portMAX_DELAY);
        while (1) {
            //wait dma fram buf
            xQueueReceive(s_state->data_ready, (void *)&fram_item, portMAX_DELAY);
            if ( fb_sta == FRAM_BUF_IDLE  && fram_item.fram_id != 0) {
                continue;
            }
            // If the queue is full, we may lose some frames
            if (expect_id != fram_item.fram_id) {
                expect_id = 0;
                if (fram_item.fram_id != 0) {
                    fb_sta = FRAM_BUF_IDLE;
                    ESP_LOGD(TAG, "Bad fram\n");
                    continue;
                }
                //A new frame start
            }
            fb_sta = FRAM_BUF_IN_PROGRESS;
            //DMA filter
            (*s_state->dma_filter)(fram_item.dma_buf_id, fram_item.fram_id, fb);
            expect_id += s_state->dma_desc_inc_cnt;
            if ((fram_item.fram_id == s_state->dma_suc_eof_max - s_state->dma_desc_inc_cnt) || fram_item.fram_sta == FRAM_DONE) {
                expect_id = 0;
                fb_sta = FRAM_BUF_IDLE;
                xQueueSend(s_state->fb_out, &fb, portMAX_DELAY);
                break;
            }
        }
    }
}

static esp_err_t dma_desc_init(void)
{
    size_t line_size = s_state->width * s_state->in_bytes_per_pixel;
    size_t dma_per_line = ((DMA_BUF_MAX_SIZE / line_size) & 0xfe);
    size_t buf_size = line_size * dma_per_line;
    size_t dma_desc_count = DMA_DESC_CNT;
    s_state->dma_buf_width = buf_size;
    s_state->dma_per_line = dma_per_line;
    s_state->dma_suc_eof_max = s_state->height / dma_per_line;
    ESP_LOGD(TAG, "DMA buffer size: %d, DMA buffers per line: %d", buf_size, dma_per_line);
    ESP_LOGD(TAG, "DMA buffer count: %d", dma_desc_count);
    ESP_LOGD(TAG, "DMA buffer total: %d bytes", buf_size * dma_desc_count);
    s_state->dma_buf = (dma_elem_t**) malloc(sizeof(dma_elem_t*) * dma_desc_count);
    if (s_state->dma_buf == NULL) {
        return ESP_ERR_NO_MEM;
    }
    s_state->dma_desc = (lldesc_t*) malloc(sizeof(lldesc_t) * dma_desc_count);
    if (s_state->dma_desc == NULL) {
        return ESP_ERR_NO_MEM;
    }
    memset(s_state->dma_desc, 0, sizeof(lldesc_t) * dma_desc_count);
    for (int i = 0; i < dma_desc_count; ++i) {
        ESP_LOGI(TAG, "Allocating DMA buffer #%d, size=%d", i, buf_size);
        // dma_elem_t* buf = (dma_elem_t*) malloc(buf_size);
        dma_elem_t* buf = (dma_elem_t*)heap_caps_calloc(buf_size, 1, MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
        if (buf == NULL) {
            return ESP_ERR_NO_MEM;
        }
        s_state->dma_buf[i] = buf;
        ESP_LOGI(TAG, "dma_buf[%d]=%p", i, buf);

        s_state->dma_desc[i].size = buf_size;
        s_state->dma_desc[i].length = buf_size;
        s_state->dma_desc[i].owner = 1;
        s_state->dma_desc[i].buf = (uint8_t*)buf;
        s_state->dma_desc[i].eof = 1;
        s_state->dma_desc[i].empty = &s_state->dma_desc[(i + 1) % dma_desc_count];
    }
    s_state->dma_sample_count = buf_size * s_state->dma_desc_inc_cnt; //reduce the isr count
    return ESP_OK;
}

static void camera_fb_deinit(void)
{
    camera_fb_int_t * _fb1 = s_state->fb, * _fb2 = NULL;
    while (s_state->fb) {
        _fb2 = s_state->fb;
        s_state->fb = _fb2->next;
        if (_fb2->next == _fb1) {
            s_state->fb = NULL;
        }
        free(_fb2->buf);
        free(_fb2);
    }
}

