xiongyumail/esp32-s2beta-hmi/project/camera/components/esp32-camera/driver/camera_32s2.c
static void dma_desc_deinit(void)
{
    if (s_state->dma_buf) {
        for (int i = 0; i < DMA_DESC_CNT; ++i) {
            free(s_state->dma_buf[i]);
        }
    }
    free(s_state->dma_buf);
    free(s_state->dma_desc);
}

static esp_err_t camera_fb_init(size_t count)
{
    if (!count) {
        return ESP_ERR_INVALID_ARG;
    }

    camera_fb_deinit();

    ESP_LOGI(TAG, "Allocating %u frame buffers (%d KB total)", count, (s_state->fb_size * count) / 1024);

    camera_fb_int_t * _fb = NULL, * _fb1 = NULL, * _fb2 = NULL;
    for (int i = 0; i < count; i++) {
        _fb2 = (camera_fb_int_t *)malloc(sizeof(camera_fb_int_t));
        if (!_fb2) {
            goto fail;
        }
        memset(_fb2, 0, sizeof(camera_fb_int_t));
        _fb2->size = s_state->fb_size;

        ESP_LOGI(TAG, "Allocating %d KB frame buffer in PSRAM", s_state->fb_size / 1024);
        _fb2->buf = (uint8_t*) heap_caps_calloc(_fb2->size, 1, MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
        if (!_fb2->buf) {
            free(_fb2);
            ESP_LOGE(TAG, "Allocating %d KB frame buffer Failed", s_state->fb_size / 1024);
            goto fail;
        } else {
            ESP_LOGI(TAG, "Allocating frame buffers-%d  at %p", i, _fb2->buf);
        }
        memset(_fb2->buf, 0, _fb2->size);
        _fb2->next = _fb;
        _fb = _fb2;
        if (!i) {
            _fb1 = _fb2;
        }
    }
    if (_fb1) {
        _fb1->next = _fb;
    }

    s_state->fb = _fb;//load first buffer

    return ESP_OK;

fail:
    while (_fb) {
        _fb2 = _fb;
        _fb = _fb->next;
        free(_fb2->buf);
        free(_fb2);
    }
    return ESP_ERR_NO_MEM;
}

typedef union {
    struct {
        uint16_t gh: 3;
        uint16_t r : 5;
        uint16_t b: 5;
        uint16_t gl: 3;
    };
    uint16_t val;
} rgb_565_sw_t;

typedef union {
    struct {
        uint16_t b: 5;
        uint16_t g: 6;
        uint16_t r : 5;
    };
    uint16_t val;
} rgb_565_t;

static void IRAM_ATTR dma_filter_rgb565(int dma_buf_id, int frame_id, camera_fb_int_t *fb)
{
    uint16_t *psrc = (uint16_t *)s_state->dma_buf[dma_buf_id];
    uint16_t *pdst = s_state->fb->buf + frame_id * s_state->dma_per_line * s_state->fb_bytes_per_pixel * s_state->width;
    for (int i = 0; i < s_state->dma_buf_width / 2; i++) {
        pdst[i] = (psrc[i] << 8) | (psrc[i] >> 8);
    }
    psrc = (uint16_t *)s_state->dma_buf[dma_buf_id + 1];
    pdst = s_state->fb->buf + (frame_id + 1) * s_state->dma_per_line * s_state->fb_bytes_per_pixel * s_state->width;
    for (int i = 0; i < s_state->dma_buf_width / 2; i++) {
        pdst[i] = (psrc[i] << 8) | (psrc[i] >> 8);
    }
}

static void IRAM_ATTR dma_filter_rgb888(int dma_buf_id, int frame_id, camera_fb_int_t *fb)
{
    rgb_565_sw_t *rgb_sw = (rgb_565_sw_t *)s_state->dma_buf[dma_buf_id];
    uint8_t *pdst = s_state->fb->buf + frame_id * s_state->dma_per_line * s_state->fb_bytes_per_pixel * s_state->width;
    for (int i = 0; i < s_state->dma_buf_width / 2; i++) {
        pdst[0] = (rgb_sw[i].b) << 3;
        pdst[1] = ((rgb_sw[i].gh) << 5) | ((rgb_sw[i].gl) << 2);
        pdst[2] = (rgb_sw[i].r << 3);
        pdst += 3;
    }
    rgb_sw = (rgb_565_sw_t *)s_state->dma_buf[dma_buf_id];
    pdst = s_state->fb->buf + (frame_id + 1) * s_state->dma_per_line * s_state->fb_bytes_per_pixel * s_state->width;
    for (int i = 0; i < s_state->dma_buf_width / 2; i++) {
        pdst[0] = (rgb_sw[i].b) << 3;
        pdst[1] = ((rgb_sw[i].gh) << 5) | ((rgb_sw[i].gl) << 2);
        pdst[2] = (rgb_sw[i].r << 3);
        pdst += 3;
    }
}

static void IRAM_ATTR dma_filter_jpeg(int dma_buf_id, int frame_id, camera_fb_int_t *fb)
{
    ets_printf("get  %d\n", s_state->dma_desc[dma_buf_id].length);
    return;
    uint16_t *psrc = (uint16_t *)s_state->dma_buf[dma_buf_id];
    uint16_t *pdst = s_state->fb->buf + frame_id * 3840;
    memcpy(pdst, psrc, s_state->dma_desc[dma_buf_id].length);
    s_state->dma_desc[dma_buf_id].length = 0;
}

static esp_err_t camera_init(const camera_config_t* config)
{
    if (!s_state) {
        return ESP_ERR_INVALID_STATE;
    }
    if (s_state->sensor.id.PID == 0) {
        return ESP_ERR_CAMERA_NOT_SUPPORTED;
    }
    memcpy(&s_state->config, config, sizeof(*config));
    esp_err_t err = ESP_OK;
    framesize_t frame_size = (framesize_t) config->frame_size;
    pixformat_t pix_format = (pixformat_t) config->pixel_format;
    s_state->width = resolution[frame_size][0];
    s_state->height = resolution[frame_size][1];
    s_state->dma_desc_inc_cnt = 2;
    if (pix_format == PIXFORMAT_GRAYSCALE) {
        s_state->fb_size = s_state->width * s_state->height;
        if (s_state->sensor.id.PID == OV3660_PID) {
            if (is_hs_mode()) {
                // s_state->sampling_mode = SM_0A00_0B00;
                // s_state->dma_filter = &dma_filter_yuyv_highspeed;
            } else {
                // s_state->sampling_mode = SM_0A0B_0C0D;
                // s_state->dma_filter = &dma_filter_yuyv;
            }
            s_state->in_bytes_per_pixel = 1;       // camera sends Y8
        } else {
            if (is_hs_mode() && s_state->sensor.id.PID != OV7725_PID) {
                // s_state->sampling_mode = SM_0A00_0B00;
                // s_state->dma_filter = &dma_filter_grayscale_highspeed;
            } else {
                // s_state->sampling_mode = SM_0A0B_0C0D;
                // s_state->dma_filter = &dma_filter_grayscale;
            }
            s_state->in_bytes_per_pixel = 2;       // camera sends YU/YV
        }
        s_state->fb_bytes_per_pixel = 1;       // frame buffer stores Y8
    } else if (pix_format == PIXFORMAT_YUV422 || pix_format == PIXFORMAT_RGB565) {
        s_state->fb_size = s_state->width * s_state->height * 2;
        s_state->dma_filter = &dma_filter_rgb565;
        if (is_hs_mode() && s_state->sensor.id.PID != OV7725_PID) {
            // s_state->sampling_mode = SM_0A00_0B00;
            // s_state->dma_filter = &dma_filter_yuyv_highspeed;
        } else {
            // s_state->sampling_mode = SM_0A0B_0C0D;
            // s_state->dma_filter = &dma_filter_yuyv;
        }
        s_state->in_bytes_per_pixel = 2;       // camera sends YU/YV
        s_state->fb_bytes_per_pixel = 2;       // frame buffer stores YU/YV/RGB565
    } else if (pix_format == PIXFORMAT_RGB888) {
        s_state->fb_size = s_state->width * s_state->height * 3;
        s_state->dma_filter = &dma_filter_rgb888;
        s_state->in_bytes_per_pixel = 2;       // camera sends RGB565
        s_state->fb_bytes_per_pixel = 3;       // frame buffer stores RGB888
    } else if (pix_format == PIXFORMAT_JPEG) {
        if (s_state->sensor.id.PID != OV2640_PID && s_state->sensor.id.PID != OV3660_PID) {
            ESP_LOGE(TAG, "JPEG format is only supported for ov2640 and ov3660");
            err = ESP_ERR_NOT_SUPPORTED;
            goto fail;
        }
        int qp = config->jpeg_quality;
        int compression_ratio_bound = 1;
        if (qp > 10) {
            compression_ratio_bound = 16;
        } else if (qp > 5) {
            compression_ratio_bound = 10;
        } else {
            compression_ratio_bound = 4;
        }
        (*s_state->sensor.set_quality)(&s_state->sensor, qp);
        s_state->in_bytes_per_pixel = 2;
        s_state->fb_bytes_per_pixel = 2;
        s_state->dma_desc_inc_cnt = 1;
        s_state->fb_size = (s_state->width * s_state->height * s_state->fb_bytes_per_pixel) / compression_ratio_bound;
        s_state->dma_filter = &dma_filter_jpeg;
        // s_state->sampling_mode = SM_0A00_0B00;
    } else {
        ESP_LOGE(TAG, "Requested format is not supported");
        err = ESP_ERR_NOT_SUPPORTED;
        goto fail;
    }

    // ESP_LOGD(TAG, "in_bpp: %d, fb_bpp: %d, fb_size: %d, mode: %d, width: %d height: %d",
    //          s_state->in_bytes_per_pixel, s_state->fb_bytes_per_pixel,
    //          s_state->fb_size, s_state->sampling_mode,
    //          s_state->width, s_state->height);

    i2s_init();

